misc/C2BPaymentValidationRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:c2b="http://cps.huawei.com/cpsinterface/c2bpayment">
    <soapenv:Header/>
    <soapenv:Body>
        <c2b:C2BPaymentValidationRequest>
            <TransactionType>PayBill</TransactionType>
            <TransID>1234560000007031</TransID>
            <TransTime>20140227082020</TransTime>
            <TransAmount>123.00</TransAmount>
            <BusinessShortCode>12345</BusinessShortCode>
            <BillRefNumber/>
            <InvoiceNumber/>
            <MSISDN>254722703614</MSISDN>
            <KYCInfo>
                <KYCName>[Personal Details][First Name]</KYCName>
                <KYCValue>Hoiyor</KYCValue>
            </KYCInfo>
            <KYCInfo>
                <KYCName>[Personal Details][Middle Name]</KYCName>
                <KYCValue>G</KYCValue>
            </KYCInfo>
            <KYCInfo>
                <KYCName>[Personal Details][Last Name]</KYCName>
                <KYCValue>Chen</KYCValue>
            </KYCInfo>
        </c2b:C2BPaymentValidationRequest>
    </soapenv:Body>
</soapenv:Envelope>
